Tekla.Structures.Model.RebarSplice.RebarSpliceBarPositionsEnum
The bar group positions in the splice.

Tekla.Structures.Model.RebarSplice.RebarSpliceBarPositionsEnum.SPLICE_BAR_ON_TOP
Joined bars on top of each other.

Tekla.Structures.Model.RebarSplice.RebarSpliceBarPositionsEnum.SPLICE_BAR_PARALLEL
Joined bars parallel to each other.